{
  "main": {
    "name": "Andrus Chen",
    "occupation": " Full Stack Software Engineer",
    "description": " currently employed by ",
    "employer": "",
    "jobDescription": "push pixels, shuffle data, and slap my keyboard until everything works",
    "image": "Modified_.jpg",
    "bio": "As a teenager at school, I was the kid other students approached about issues with their phones or laptop. I was the go-to guy for fixing any technical problems. Today, not much has changed. I’m still the first point of call for technical issues. The difference is I now also develop innovative software to solve the problems of multinational companies. One of my most recent projects involved designing and rolling out a new piece of software to optimize the efficiency of making better decisions for real estate professionals. In my spare time, I try to learn new technologies and best practices which really keep me up-to-date and growing up all the time.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "AndrusChen0106@gmail.com",
    "phone": "(372) 602-7680",
    "address": {
      "street": "Viru 16",
      "city": "Tallinn",
      "state": "Harjumaa",
      "zip": "10319"
    },
    "website": "https://andruschen.github.io/potfolio/#home",
    "resumedownload": "https://drive.google.com/file/d/1z087VX2q4-szI2ANGlVok0oJZOmb-zMt/view",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/andrus-chen-831662259/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/AndrusChen",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I am passionate to learn new technologies and best practices, so this really keeps myself up-to-date and keep me growing all the time.",
    "education": [
      {
        "school": "Lingnan University",
        "degree": "Bachelors in Computer Science, Software Engineering Option",
        "graduated": "October 2014",
        "description": "Here I took my Bachelors of Computer Science with a Software Engineering Specialty and achieved a much more thorough education in the underlying theory, concepts, and science behind more complex programming. It was here that I discovered my passion for scalable application programming (web and mobile), the security behind computer and application systems, and found that I have a knack for understanding complex algorithms."
      }
    ],
    "work": [
      {
        "company": "DLT Science Foundation",
        "title": "Front End Developer",
        "years": "09/2022 - 07/2023",
        "description": "Results-driven Front End Engineer at DLT Science Foundation, optimizing analytics dashboard performance, integrating advanced chart features, and ensuring scalability through AWS deployment. Elevated performance and user experience by developing a Next.js frontend for analytics dashboard and coin data, resulting in a 40% increase in page loading speed. Enhanced stock chart capabilities by seamlessly integrating Highchart.js, enabling advanced data visualization options. Achieved a 30% improvement in data retrieval efficiency by utilizing AWS S3 to fetch and generate time series values for the stock chart. Ensured seamless and reliable user access with a successful deployment of the frontend on AWS Amplify and Vercel, resulting in a 99.9% uptime rate. Boosted WordPress site performance and security through meticulous refactoring on AWS EC2, leading to a 25% reduction in loading time and enhanced data protection. Collaborated seamlessly with a team of five developers using Agile methodology and Notion board, expediting project completion by 20%. Demonstrated expertise in problem-solving by swiftly resolving complex technical issues, maintaining uninterrupted frontend functionality and minimizing downtime."
      },
      {
        "company": "NIGRUM-TECH GbR",
        "title": "Full Stack Software Engineer",
        "years": "04/2020 - 07/2022",
        "description": "Accomplished full-stack developer spearheading the design and implementation of an innovative automatic restaurant ordering system. ● Orchestrated the creation of an automatic restaurant ordering system, meticulously designing the database and employing Java Spring Boot for backend development, resulting in a 40% reduction in order processing time. ● Developed an Android app tailored for smartwatches, empowering restaurant waiters with efficient order management capabilities, contributing to a 25% increase in order accuracy. ● Strategically integrated backend systems with table-installed order buttons, ensuring real-time synchronization and achieving a seamless dining experience for customers, resulting in a 15% decrease in order turnaround time. ● Utilized Angular to craft a user-friendly front-end interface, providing restaurant managers with intuitive controls for overseeing operations, ultimately leading to a 30% improvement in overall managerial efficiency. ● Introduced Install Wizard to simplify initial setup for managers. ● Innovated a statistical module producing dynamic daily, weekly, and monthly employee reports with visual graphs, resulting in a 20% increase in staff productivity. ● Created an efficient Sendinblue API-based email system, reducing data dissemination time by 30% and enhancing decision-making and communication"
      },
      {
        "company": "Top Hap",
        "title": "Front End Developer",
        "years": "07/2017 - 02/2020",
        "description": "Experienced React developer driving UI enhancements and efficient API calls. ● Developed front end with React.js, Implemented Redux data structure, and made APIs calls with redux-thunk. ● Built 100+ components in React using NodeJS asynchronous methods. ● Redesigned our website—increasing visitor clicks by 37% and customer referrals by 12%. ● Assisted in developing server-based Node.js & AWS software by providing inputs and insights, acquiring a 15% increase in the quality of overall work. ● Implemented search functionality using Elasticsearch—decreasing overall service latency by 25.6%"
      }
    ],
    "skills": [
      {
        "name": "React Js",
        "image": "react.jpg"
      },
      {
        "name": "AWS",
        "image": "aws.png"
      },
      {
        "name": "Node JS",
        "image": "node.jpg"
      },
      {
        "name": "JavaScript",
        "image": "js.png"
      },
      {
        "name": "TypeScript",
        "image": "ts.png"
      },
      {
        "name": "Bootstrap 4",
        "image": "bootstrap.jpg"
      },
      {
        "name": "Angular",
        "image": "angular.png"
      },
      {
        "name": "Vue",
        "image": "vue.png"
      },
      {
        "name": "Cypress",
        "image": "cypress.jpg"
      },
      {
        "name": "HTML5",
        "image": "html.png"
      },
      {
        "name": "Elastic Search",
        "image": "elastic.png"
      },
      {
        "name": "Redux",
        "image": "redux.png"
      },
      {
        "name": "MongoDB",
        "image": "mongo.jpg"
      },
      {
        "name": "Laravel",
        "image": "laravel.png"
      },
      {
        "name": "CSS3",
        "image": "css.png"
      },
      {
        "name": "Git",
        "image": "git.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Intelligent Market Platform",
        "category": "Intelligent Market Platform for real estate professionals",
        "image": "TopHap.jpg",
        "url": "https://www.tophap.com/"
      },
      {
        "title": "Cloud Augmented Mass Appraisal",
        "category": "The model for property appraisal standards in our industry",
        "image": "trueProdigy.jpg",
        "url": "https://trueprodigy.com/"
      },
      {
        "title": "Systematix Infotech Pvt",
        "category": "Digital breakthroughs to transform your business",
        "image": "systematix.jpg",
        "url": "https://www.softude.com/"
      },
      {
        "title": "Discord bot",
        "category": "Create a library that would simplify discord bot creation for developers",
        "image": "Discord.jpg",
        "url": "https://github.com/AndrusChen/Discord-bot/tree/main"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the opportunity to work with Andrus on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Andrus excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user": "Nikola Matic - Web Developer at SwyftPain"
      }
    ]
  }
}
